Revit 2024 API
ExternalServices.BuiltInExternalServices.ExternalResourceUIService Property
 The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ExternalResourceUIService { get; }
Visual Basic
Public Shared ReadOnly Property ExternalResourceUIService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ExternalResourceUIService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace